In [ ]:
## PANDAS LIBRARY

# 0- Installing Numpy
# 1- Importing Numpy

In [ ]:
## PANDAS-DataFrame & Series - Data Manipulation library used for data analysis and data cleaning. It provide two primary data structures: Series and DataFrame.
#                              while dataFrame is two-dimensional, size-mutable, and hetrogeneous data structure with
#                              labeled axes(rows & columns)

In [ ]:
## SERIES -  A series is one-dimensional array-like object that can hold any data type. It is similar to a column in table

import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)
print(type(series))                 # First Column is idex

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
## CREATE SERIES FROM DICTIONARY

dict = {'a':1,'b':2,'c':3,'d':4,'e':5,}
into_series = pd.Series(dict)
print(into_series)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
# Assign Index

data = [1,2,3,4]
index = ['a','b','c','d']

pd.Series(data,index=index)

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
## DATAFRAME - Two dimensional Array (Multiple rows and columns)

# Create a dataFrame from dictionary of list

data = { 
    'Name':['Mehdi','Wasiq','Haseeb'],
    'Age':[23,22,22],
    'Location':['Germany','Belgium','Italy'],
    'Money':['100M','25M','40M']
} 

df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age Location Money
0   Mehdi   23  Germany  100M
1   Wasiq   22  Belgium   25M
2  Haseeb   22    Italy   40M
<class 'pandas.core.frame.DataFrame'>

In [10]:
# Create a dataFrame with the list of dictionaries

data = [ 
    {'Name':'Mehdi','Age': 23, 'City':'Germany'},
    {'Name':'Wasiq','Age': 22, 'City':'Belgium'},
    {'Name':'Haseeb','Age': 22, 'City':'Italy'},
    {'Name':'Hussain','Age': 21, 'City':'Saudi Arab'},
] 

df = pd.DataFrame(data)
print(df)

      Name  Age        City
0    Mehdi   23     Germany
1    Wasiq   22     Belgium
2   Haseeb   22       Italy
3  Hussain   21  Saudi Arab

In [ ]:
## READING CSV FILE

df = pd.read_csv('sales_data.csv')                           # read_csv is a funtions
df.head(5)                                                   # head(5) is showing top 5 results from the data sheet

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [ ]:
df.tail(5)                                                   # tail(5) is showing bottom 5 results from the data sheet

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [18]:
## ACCESSING DATA FROM THE DATAFRAME

data = [ 
    {'Name':'Mehdi','Age': 23, 'City':'Germany'},
    {'Name':'Wasiq','Age': 22, 'City':'Belgium'},
    {'Name':'Haseeb','Age': 22, 'City':'Italy'},
    {'Name':'Hussain','Age': 21, 'City':'Saudi Arab'},
]

df = pd.DataFrame(data)
print(df)

      Name  Age        City
0    Mehdi   23     Germany
1    Wasiq   22     Belgium
2   Haseeb   22       Italy
3  Hussain   21  Saudi Arab

In [19]:
df['Name']

0      Mehdi
1      Wasiq
2     Haseeb
3    Hussain
Name: Name, dtype: object

In [ ]:
df.loc[1]                               # "loc" working with row index

Name      Wasiq
Age          22
City    Belgium
Name: 1, dtype: object

In [25]:
df.iloc[0]                              # "iloc" working with column index

Name      Mehdi
Age          23
City    Germany
Name: 0, dtype: object

In [26]:
## ACCESSING SPECIFIC ELEMENTS

df

      Name  Age        City
0    Mehdi   23     Germany
1    Wasiq   22     Belgium
2   Haseeb   22       Italy
3  Hussain   21  Saudi Arab

In [32]:
df.at[0,'Name']

'Mehdi'

In [ ]:
df.iat[1,2]                             # giving both column and row index

'Belgium'

In [34]:
## DATA MANIPULATION WITH DATAFRAME

df

      Name  Age        City
0    Mehdi   23     Germany
1    Wasiq   22     Belgium
2   Haseeb   22       Italy
3  Hussain   21  Saudi Arab

In [49]:
# Adding Column

df['Income']=[10000,2000,30000,40000]
df

      Name  Age        City  Income
0    Mehdi   23     Germany   10000
1    Wasiq   22     Belgium    2000
2   Haseeb   22       Italy   30000
3  Hussain   21  Saudi Arab   40000

In [54]:
# Removing Column

df.drop('Income', axis=1, inplace=True)

TypeError: 'list' object is not callable

In [ ]:
# Incrementing

df['Age'] = df['Age']+1
df

      Name  Age        City  Income
0    Mehdi   24     Germany   10000
1    Wasiq   23     Belgium    2000
2   Haseeb   23       Italy   30000
3  Hussain   22  Saudi Arab   40000

In [ ]:
df = pd.read_csv('sales_data.csv')
df.describe()                                       # Decribe() is used to display statistical analysis

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000